; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	satellite7 - satellite
	instrument12 - instrument
	instrument13 - instrument
	image4 - mode
	spectrograph1 - mode
	spectrograph3 - mode
	image6 - mode
	image0 - mode
	spectrograph5 - mode
	thermograph2 - mode
	GroundStation4 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image4)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument3 thermograph2)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 spectrograph5)
	(supports instrument4 image0)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument5 image6)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star2)
	(supports instrument6 spectrograph3)
	(supports instrument6 image4)
	(supports instrument6 thermograph2)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph2)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star0)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 Star0)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon5)
	(supports instrument10 image6)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation3)
	(supports instrument11 thermograph2)
	(supports instrument11 image6)
	(calibration_target instrument11 Star0)
	(on_board instrument11 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star2)
	(supports instrument12 image6)
	(supports instrument12 spectrograph3)
	(calibration_target instrument12 Star0)
	(supports instrument13 spectrograph1)
	(supports instrument13 image6)
	(supports instrument13 image4)
	(calibration_target instrument13 Star0)
	(on_board instrument12 satellite7)
	(on_board instrument13 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star2)
)
(:goal (and
	(pointing satellite2 GroundStation3)
	(pointing satellite3 Planet9)
	(pointing satellite5 Phenomenon8)
	(pointing satellite6 Star6)
	(have_image Phenomenon5 spectrograph1)
	(have_image Phenomenon5 spectrograph3)
	(have_image Star6 thermograph2)
	(have_image Star7 image0)
	(have_image Star7 spectrograph5)
	(have_image Phenomenon8 image0)
	(have_image Planet9 spectrograph1)
	(have_image Planet9 image6)
))

)

; plan
1. (turn_to satellite6 star6 star2)
   deleted: (pointing satellite6 star2)
   added: (pointing satellite6 star6)
   goals met: 1 of 12
2. (turn_to satellite5 groundstation1 groundstation3)
   deleted: (pointing satellite5 groundstation3)
   added: (pointing satellite5 groundstation1)
   goals met: 1 of 12
3. (switch_on instrument10 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument10)
   goals met: 1 of 12
4. (calibrate satellite5 instrument10 groundstation1)
   added: (calibrated instrument10)
   goals met: 1 of 12
5. (turn_to satellite5 planet9 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 planet9)
   goals met: 1 of 12
6. (take_image satellite5 planet9 instrument10 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 2 of 12
7. (take_image satellite5 planet9 instrument10 image6)
   added: (have_image planet9 image6)
   goals met: 3 of 12
8. (turn_to satellite5 phenomenon5 planet9)
   deleted: (pointing satellite5 planet9)
   added: (pointing satellite5 phenomenon5)
   goals met: 3 of 12
9. (turn_to satellite3 groundstation3 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 groundstation3)
   goals met: 3 of 12
10. (turn_to satellite2 star2 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star2)
   goals met: 3 of 12
11. (take_image satellite5 phenomenon5 instrument10 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 4 of 12
12. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 4 of 12
13. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 4 of 12
14. (calibrate satellite3 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 4 of 12
15. (calibrate satellite2 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 4 of 12
16. (turn_to satellite2 phenomenon8 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon8)
   goals met: 4 of 12
17. (take_image satellite2 phenomenon8 instrument4 image0)
   added: (have_image phenomenon8 image0)
   goals met: 5 of 12
18. (turn_to satellite2 star7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star7)
   goals met: 5 of 12
19. (take_image satellite2 star7 instrument4 image0)
   added: (have_image star7 image0)
   goals met: 6 of 12
20. (take_image satellite2 star7 instrument4 spectrograph5)
   added: (have_image star7 spectrograph5)
   goals met: 7 of 12
21. (turn_to satellite2 groundstation3 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation3)
   goals met: 8 of 12
22. (turn_to satellite3 phenomenon5 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 phenomenon5)
   goals met: 8 of 12
23. (take_image satellite3 phenomenon5 instrument6 spectrograph3)
   added: (have_image phenomenon5 spectrograph3)
   goals met: 9 of 12
24. (turn_to satellite3 star6 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 star6)
   goals met: 9 of 12
25. (take_image satellite3 star6 instrument6 thermograph2)
   added: (have_image star6 thermograph2)
   goals met: 10 of 12
26. (turn_to satellite3 planet9 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 planet9)
   goals met: 11 of 12
27. (turn_to satellite5 phenomenon8 phenomenon5)
   deleted: (pointing satellite5 phenomenon5)
   added: (pointing satellite5 phenomenon8)
   goals met: 12 of 12
